[
  {
    "category": "Tourism & Travel",
    "services": [
      {
        "id": 1,
        "title": "Tourist Visa",
        "description": "A Tourist Visa is designed for travelers visiting for leisure or vacations. It allows participation in sightseeing tours, cultural visits, and recreational activities. Applicants must provide proof of accommodation and return travel. Temporary stays are permitted and financial stability must be shown. This visa ensures a hassle-free holiday experience for tourists.",
        "processingTime": "2 - 6 weeks",
        "price": "$50",
        "image": "https://i.postimg.cc/50kPrDXh/backpacker-standing-sunrise-viewpoint-ja-bo-village-mae-hong-son-province-thailand.jpg"
      },
      {
        "id": 2,
        "title": "Business Visit Visa",
        "description": "Business Visit Visa is intended for professionals attending meetings, conferences, or corporate events abroad. Applicants must provide proof of business engagement or invitation letters. It allows networking, attending workshops, and company visits. Short-term work-related activities are permitted. This visa ensures smooth entry for international business travelers.",
        "processingTime": "1 - 4 weeks",
        "price": "$80",
        "image": "https://i.postimg.cc/RZR2RsTB/781cfa1f542ee24071dc5039d4d3ea6f.jpg"
      },
      {
        "id": 3,
        "title": "Medical Visa",
        "description": "Medical Visa is for individuals seeking healthcare or treatment abroad. It covers surgeries, consultations, and therapies in recognized hospitals. Applicants must submit medical reports and confirmation from the healthcare provider. Family members may accompany the patient. This visa facilitates timely medical attention for travelers.",
        "processingTime": "2 - 5 weeks",
        "price": "$100",
        "image": "https://i.postimg.cc/NfVxw1fH/52382debaee74ed98250af1cfea4210a.jpg"
      },
      {
        "id": 4,
        "title": "Event Visa",
        "description": "Event Visa allows attendance at concerts, sports events, cultural festivals, and exhibitions abroad. Applicants must provide proof of event registration or invitation. Short-term stays are permitted for participants or observers. This visa ensures seamless travel for international events. It is ideal for travelers seeking entertainment or networking opportunities.",
        "processingTime": "2 - 4 weeks",
        "price": "$75",
        "image": "https://i.postimg.cc/FHzs0LjD/43eda55fa6c0336a30f2ea3dac3998bc.jpg"
      }
    ]
  },
  {
    "category": "Education",
    "services": [
      {
        "id": 5,
        "title": "Student Visa",
        "description": "Student Visa is for individuals pursuing academic programs abroad. It covers universities, colleges, and diploma courses. Applicants must provide acceptance letters and financial proof. The visa allows full-time study and part-time work if permitted. Family members may join depending on the country regulations.",
        "processingTime": "4 - 12 weeks",
        "price": "$120",
        "image": "https://i.postimg.cc/W4RLtFSD/b4980ab48aebf52688043ef05f04c463.jpg"
      },
      {
        "id": 6,
        "title": "Exchange Program Visa",
        "description": "Exchange Program Visa is for students participating in semester abroad or exchange programs. It ensures temporary residence for academic purposes. Applicants must submit enrollment confirmation from both home and host institutions. Short-term work opportunities may be allowed. This visa fosters cultural and educational exchange.",
        "processingTime": "3 - 8 weeks",
        "price": "$100",
        "image": "https://i.postimg.cc/SQgBCtDb/47073e9002b67c3f1be9f0b49c46bbf6.jpg"
      },
      {
        "id": 7,
        "title": "Language Study Visa",
        "description": "Language Study Visa is for students attending short-term language courses abroad. It covers language schools and intensive programs. Applicants must provide enrollment proof and financial documents. The visa permits temporary stay and cultural immersion. It is ideal for improving language skills in a foreign environment.",
        "processingTime": "2 - 6 weeks",
        "price": "$90",
        "image": "https://i.postimg.cc/q7QLSWtk/323b4ae39edb18d6f4150f5ce30f5ff1.jpg"
      },
      {
        "id": 8,
        "title": "Research Visa",
        "description": "Research Visa is for scholars, scientists, and researchers conducting studies abroad. Applicants must submit project proposals and host institution invitation. It allows participation in research, conferences, and academic collaborations. Short-term work may be permitted. This visa supports academic and scientific advancement internationally.",
        "processingTime": "3 - 10 weeks",
        "price": "$150",
        "image": "https://i.ibb.co.com/1GHVcHHj/student-visa-1.jpg"
      }
    ]
  },
  {
    "category": "Employment",
    "services": [
      {
        "id": 9,
        "title": "Work Visa",
        "description": "Work Visa is for individuals employed by foreign companies. It allows legal employment, salary reception, and tax compliance abroad. Applicants must provide job contracts and sponsorship letters. Temporary or long-term stays are permitted depending on employment duration. This visa facilitates international career opportunities.",
        "processingTime": "2 - 4 months",
        "price": "$200",
        "image": "https://i.ibb.co.com/LXPm7N1b/Employment-3.jpg"
      },
      {
        "id": 10,
        "title": "Skilled Worker Visa",
        "description": "Skilled Worker Visa is for highly skilled professionals migrating for jobs. Applicants must demonstrate professional qualifications and experience. The visa allows long-term employment and residence. Family accompaniment may be permitted. It is ideal for engineers, doctors, IT specialists, and other skilled professionals seeking opportunities abroad.",
        "processingTime": "3 - 6 months",
        "price": "$250",
        "image": "https://i.ibb.co.com/zYZ1scH/Employment-5.jpg"
      },
      {
        "id": 11,
        "title": "Seasonal Worker Visa",
        "description": "Seasonal Worker Visa is for individuals employed in seasonal industries like agriculture, tourism, or hospitality. Applicants must have employment contracts for limited periods. It allows temporary residence and work authorization. Proper documentation of employer and accommodation is required. This visa supports seasonal labor mobility internationally.",
        "processingTime": "4 - 8 weeks",
        "price": "$180",
        "image": "https://i.ibb.co.com/sJygsmfd/Employment-1.jpg"
      },
      {
        "id": 12,
        "title": "Freelancer Visa",
        "description": "Freelancer Visa is for independent professionals offering remote services abroad. Applicants must provide proof of contracts, portfolio, and financial stability. The visa allows flexible work without local employment sponsorship. Temporary residence is permitted depending on the host country. It is ideal for digital nomads and remote workers.",
        "processingTime": "6 - 10 weeks",
        "price": "$150",
        "image": "https://i.ibb.co.com/rK8tX0kW/Employment-2.jpg"
      }
    ]
  },
  {
    "category": "Family & Settlement",
    "services": [
      {
        "id": 13,
        "title": "Spouse Visa",
        "description": "Spouse Visa is for individuals joining their partners living abroad. Applicants must provide marriage certificates and sponsor proof. It allows temporary or permanent residence depending on the country. Family reunification and legal stay are permitted. This visa strengthens family unity internationally.",
        "processingTime": "2 - 6 months",
        "price": "$150",
        "image": "https://i.ibb.co.com/932BGzVd/Family-6.jpg"
      },
      {
        "id": 14,
        "title": "Dependent Visa",
        "description": "Dependent Visa is for family members dependent on primary visa holders. It covers spouses, children, or parents. Applicants must provide proof of relationship and financial support. Temporary or long-term stay is allowed. This visa ensures that family members can accompany or join the principal applicant abroad.",
        "processingTime": "2 - 5 months",
        "price": "$130",
        "image": "https://i.ibb.co.com/s9pg7SRg/Family-2.jpg"
      },
      {
        "id": 15,
        "title": "Parent Visa",
        "description": "Parent Visa is for parents joining their children living abroad. Applicants must provide proof of relationship and financial support. The visa allows temporary or long-term stay. Accommodation and health insurance documents may be required. This visa promotes family reunification and care for elderly parents internationally.",
        "processingTime": "3 - 6 months",
        "price": "$180",
        "image": "https://i.ibb.co.com/bM6Vgv7B/Family-4.jpg"
      },
      {
        "id": 16,
        "title": "Family Reunion Visa",
        "description": "Family Reunion Visa allows families separated across countries to reunite. Applicants must provide proof of relationship and sponsor support. The visa allows temporary or permanent residence. It ensures smooth immigration for family members. Ideal for parents, children, and spouses seeking to live together abroad.",
        "processingTime": "2 - 6 months",
        "price": "$170",
        "image": "https://i.ibb.co.com/qY5PqLFC/Family-1.jpg"
      }
    ]
  },
  {
    "category": "Permanent Residency",
    "services": [
      {
        "id": 17,
        "title": "Canada Visa",
        "description": "Canada PR is for individuals applying for permanent residency in Canada. Applicants must meet eligibility criteria, including skills, work experience, and language proficiency. It allows permanent stay, work, and access to social benefits. Family members may also be included in the application. This visa facilitates long-term settlement in Canada.",
        "processingTime": "6 - 12 months",
        "price": "$500",
        "image": "https://i.postimg.cc/4Ngnryp1/0a88651053338b6e18e13593c3cffc1d.jpg"
      },
      {
        "id": 18,
        "title": "Australia Visa",
        "description": "Australia PR is for individuals seeking permanent residency in Australia. Applicants must provide evidence of qualifications, employment, and English proficiency. It permits permanent residence, work, and education benefits. Family sponsorship may be included. This visa enables long-term settlement and career growth in Australia.",
        "processingTime": "6 - 12 months",
        "price": "$450",
        "image": "https://i.postimg.cc/QMyHPqqB/4651e98a222cee169a7e4aab7fff0fe7.jpg"
      },
      {
        "id": 19,
        "title": "UK Settlement Visa",
        "description": "UK Settlement Visa is for long-term residence in the United Kingdom. Applicants must meet eligibility requirements, including work or family ties. It allows permanent stay, work, and access to public services. Family members may be included. This visa ensures legal long-term settlement in the UK.",
        "processingTime": "4 - 8 months",
        "price": "$400",
        "image": "https://i.ibb.co.com/39yc487N/Permanent-1.jpg"
      },
      {
        "id": 20,
        "title": "USA Green Card",
        "description": "USA Green Card is for immigrants seeking permanent residency in the United States. Applicants must meet eligibility criteria, including family, employment, or investment categories. It allows work, education, and access to social benefits. Family members may be included. This visa is essential for long-term life and career in the USA.",
        "processingTime": "8 - 14 months",
        "price": "$550",
        "image": "https://i.ibb.co.com/qMLzZf5J/Permanent-2.jpg"
      }
    ]
  },
  {
    "category": "Special Visas",
    "services": [
      {
        "id": 21,
        "title": "Investor Visa",
        "description": "Investor Visa is for individuals investing in businesses or startups abroad. Applicants must provide investment proof and business plans. It allows temporary or permanent residence depending on country regulations. Family members may be included. This visa promotes international entrepreneurship and economic growth.",
        "processingTime": "3 - 6 months",
        "price": "$600",
        "image": "https://i.postimg.cc/fRbdrkhr/3f1ecb5697e58e70364cab5683c0fc58.jpg"
      },
      {
        "id": 22,
        "title": "Digital Nomad Visa",
        "description": "Digital Nomad Visa is for remote professionals living and working abroad. Applicants must provide proof of employment or freelancing contracts. It allows temporary residence and tax compliance. Travel flexibility and work authorization are provided. Ideal for digital nomads seeking international experiences.",
        "processingTime": "4 - 8 weeks",
        "price": "$200",
        "image": "https://i.ibb.co.com/Gf4F3syw/Special-1.jpg"
      },
      {
        "id": 23,
        "title": "Volunteer Visa",
        "description": "Volunteer Visa is for individuals participating in international volunteer programs. Applicants must provide organization invitation and project details. It allows temporary stay for community service or humanitarian work. Health insurance and accommodation proof may be required. This visa promotes cross-cultural engagement and social contribution.",
        "processingTime": "2 - 8 weeks",
        "price": "$100",
        "image": "https://i.postimg.cc/VLYjQK8v/765a788f76a4ae146d840c51380ad659.jpg"
      },
      {
        "id": 24,
        "title": "Retirement Visa",
        "description": "Retirement Visa is for retirees planning to live abroad long-term. Applicants must show proof of income or savings to support themselves. It allows extended residence and access to local services. Health coverage may be required. This visa enables a peaceful and secure retirement in a foreign country.",
        "processingTime": "2 - 5 months",
        "price": "$250",
        "image": "https://i.postimg.cc/dt8SnH90/7d494a0e1c35c56b9bce39cd5db07e77.jpg"
      }
    ]
  }
]
